# Pandas `DataFrame`

```{admonition} Learning Objectives

Questions:
* What is a Pandas `DataFrame`?
* How is a `DataFrame` used to manage and manipulate data?

Objectives:
* Understand the structure and purpose of a `DataFrame`.
* Create a `DataFrame` from lists.
* Perform basic `DataFrame` manipulations, such as renaming columns and transposing data.
* Understand the structure and purpose of a Pandas `Series`.
* Append `Series` as columns to an existing `DataFrame` and create new columns based on existing data.

## Import Pandas

In [1]:
# This line imports the pandas library and aliases it as 'pd'.

import pandas as pd

```{admonition} Why pandas as pd?
:class: tip dropdown
Aliasing pandas as `pd` is a widely adopted convention that simplifies the syntax for accessing its functionalities.\
After this statement, you can use `pd` to access all the functionalities provided by the pandas library.
````

___

## Pandas data table representation

![Representation of a Pandas DataFrame](images/01_table_dataframe.svg)

A `DataFrame` is a two-dimensional data structure in the Pandas library, designed to hold and manage data efficiently. It organizes data into labeled columns and rows, allowing you to store various types of data, such as numbers, text, and categorical values, all within the same structure.

### Creating our first `DataFrame`

We start by creating three lists of equal length (i.e., containing the same amount of elements).\
These lists will be used as columns for a `DataFrame`, with each list representing a column and each element within the list representing a row in that column.

In [2]:
# Create three lists named 'name', 'age', and 'sex'.

name = ["Braund", "Allen", "Bonnel"]
age = [22, 35, 58]
sex = ["male", "male", "female"]

We use lists `name`, `age`, and `sex` to fill in the columns.\
Each list corresponds to a column in the DataFrame.\
`Name`, `Age`, and `Sex` are the titles of these columns.

In [3]:
# Create a DataFrame named 'df' based on three lists.

df = pd.DataFrame({'Name': name, 'Age': age, 'Sex': sex})

### `DataFrames` and `dictionaries`

Creating a `DataFrame` in pandas is similar to creating a `dictionary`. The `key`s in the `dictionary` become the column names, while the `value`s, which are `list`s or `array`s, form the columns' data.

```{seealso} 
For more information on `dictionary`s in Python, see [GeeksforGeeks](https://www.geeksforgeeks.org/python-dictionary/).
```

In [4]:
# Display the DataFrame 'df'.

df

     Name  Age     Sex
0  Braund   22    male
1   Allen   35    male
2  Bonnel   58  female

In a spreadsheet software, the table representation of our data would look very similar

![Table representaion in spreadsheet software](images/01_table_spreadsheet.png)

In [5]:
# Check the type of the 'df' object using the 'type()' function.

type(df)

pandas.core.frame.DataFrame

___

## Attributes

We can use the `shape` attribute to determine the dimensions of the `DataFrame`.\
It returns a tuple representing the number of rows and columns (rows, columns). This can be helpful especially if you have not created the `DataFrame`yourself.

In [6]:
df.shape

(3, 3)

And we can use the `dtypes` attribute to view the data types of each column in the `DataFrame`.\
This command provides information about the data type of each column, such as integer, float, or object (string). This is useful knowledge to have when you start working more in-depth with your data.

In [7]:
df.dtypes

Name    object
Age      int64
Sex     object
dtype: object

When asking for the `shape` or `dtypes`, no parentheses `()` are used. Both are an attribute of `DataFrame` and `Series`. (`Series` will be explained later.)

Attributes of a `DataFrame` or `Series` do not need `()`.

Attributes represent a characteristic of a `DataFrame`/`Series`, whereas methods (which require parentheses `()`) do something with the `DataFrame`/`Series`.

___

## Transposing a `DataFrame`

The `transpose()` method swaps the `DataFrame`'s rows and columns, creating 'df_transposed'.\
Transposing is useful for reshaping data, making it easier to compare rows or apply certain operations that are typically column-based.

In [8]:
# Transpose the DataFrame 'df' using the 'transpose()' method.

df_transposed = df.transpose()

In [9]:
# Display the DataFrame 'df_transposed'.

df_transposed

           0      1       2
Name  Braund  Allen  Bonnel
Age       22     35      58
Sex     male   male  female

### Renaming columns

We can rename the columns of our `DataFrame` after creation.\
This is done by assigning a new list of column names to `df.columns`.\
The new column names are `Names`, `Age`, and `Sex`, in that order.

In [10]:
# Rename the columns of the DataFrame 'df'.

df.columns = ['Names', 'Age', 'Sex']

The method below is useful for selectively renaming only one or more columns without changing the entire set of column names:

In [11]:
# Rename the 'Age' column to 'Ages' in the DataFrame 'df'.

df = df.rename(columns={'Age': 'Ages'})

In [12]:
# Our DataFrame now looks like this:

df

    Names  Ages     Sex
0  Braund    22    male
1   Allen    35    male
2  Bonnel    58  female

___

## `Series`

![DataFrame Series](images/01_table_series.svg)

Each column in a `DataFrame` is a `Series`. When we access a column in a `DataFrame`, this actually returns a `Series` object containing all the data in that column.

In [13]:
df['Ages']

0    22
1    35
2    58
Name: Ages, dtype: int64

In [14]:
# Check the type of the 'Ages' column in 'df' using the 'type()' function.

type(df['Ages'])

pandas.core.series.Series

### Creating our own `Series`

We can create and name a `Series` in the following way.\
The `name` parameter assigns the name 'Fare' to the Series.

In [15]:
# Create a pandas Series named 'fare' with specified values.

fare = pd.Series(['7.2500', '71.2833', 'Unknown'], name='Fare')

This outputs the values along with their index positions and the name of the `Series`:

In [16]:
# Display the 'fare' Series.

fare

0     7.2500
1    71.2833
2    Unknown
Name: Fare, dtype: object

In [17]:
fare.apply(type).value_counts()

Fare
<class 'str'>    3
Name: count, dtype: int64

In [18]:
# Check the data type of 'fare' using the 'type()' function.

type(fare)

pandas.core.series.Series

Although our data looks fine at first glance, each cell is actually stored as a string.
While we can read the numbers without issue, this will cause problems if we want to use them for calculations.

To solve this, Pandas provides a built-in function called `to_numeric()`, which converts a `Series` to either an integer or a float, depending on the values.

In [19]:
fare = pd.to_numeric(fare)

ValueError: Unable to parse string "Unknown" at position 2

However, as seen above, this produces a `ValueError` due to the "Unknown" value at position 2.

To solve this, we need to use the `errors` parameter in `to_numeric()`.

## <i class="fa-solid fa-pencil"></i> Exercise

Convert the cells of the 'fare' `Series` to numeric values.\
The "Unknown" value must be convertet to `NaN` by applying the `errors` parameter in `to_numeric()`.

Hint: We can get help by using:
```python
    help(pd.to_numeric)
```

```{admonition} Solution
:class: dropdown

    fare = pd.to_numeric(fare, errors='coerce')

This solution changes all cell values to numeric values.\
Any values that cannot be converted — such as strings like "Unknown" — will be replaced with `NaN` instead of raising an error.

___

## Appending `Series`

We can add a `Series` as a new column to a `DataFrame`, extending it horizontally.\
Here, the name of the 'fare' `Series` ('Fare') becomes the column name in the updated `DataFrame`.

In [20]:
# Convert the Series' cells to numeric values

fare = pd.to_numeric(fare, errors='coerce')

# Concatenate the 'fare' Series to the 'df' DataFrame along the columns (axis=1).

df = pd.concat([df, fare], axis=1)

The `axis` parameter in `pandas.concat()` controls whether you combine data **row-wise** or **column-wise**:

- `axis=0` **(default)**: Concatenates along rows (adds more rows beneath each other).
- `axis=1`: Concatenates along columns (adds new columns side by side).

<i class="fa-solid fa-triangle-exclamation"></i> **Important:** When concatenating with `axis=1`, Pandas aligns data on the **index**. If the indices do not match, the result will contain `NaN` values wherever data is missing. This can easily lead to unexpected gaps if you haven’t ensured consistent indexing before concatenation.

In [1]:
# Display the updated DataFrame 'df'.

df

NameError: name 'df' is not defined

## <i class="fa-solid fa-pencil"></i> Exercise

Given the `Series`:

```python
extra_row = pd.Series(
    {'Names': 'Futrelle', 'Ages': 35, 'Sex': 'female', 'Fare': 53.1000}
)
```

Append this `Series` to 'df' but as a row (not a column!).

````{admonition} Solution
:class: dropdown

    df = pd.concat([df, extra_row.to_frame().T], ignore_index=True)

This solution concatenates the `extra_row` `Series` to the `df` `DataFrame` along the rows (`axis=0`). Since `axis=0` is the default in `pd.concat()`, it does not need to be written explicitly.  

The argument `ignore_index=True` is important because it forces Pandas to create a new continuous index (`0, 1, 2, …`) instead of keeping the original index values from the two objects being concatenated.\
Without `ignore_index=True`, the new row would keep its original index `0` (from the `Series` converted to a one-row `DataFrame`), resulting in duplicate indices in `df`. This can lead to confusion or unexpected behavior when selecting rows by index.  

If the column names in `extra_row` did **not** match the columns in `df`, Pandas would still perform the concatenation, but it would align only on the matching labels. Any non-matching columns would be added as new columns, and cells where data is missing would be filled with `NaN`.
````

### Creating a new column based on existing data

We can also create a new column based on the data in an existing column.

Here, we create a new column 'Age_in_3_years' in the `DataFrame` 'df'.\
This column is calculated by adding 3 to each value in the 'Ages' column.

In [22]:
df['Age_in_3_years'] = df['Ages'] + 3

In [23]:
# Display the updated DataFrame 'df'.

df

    Names  Ages     Sex     Fare  Age_in_3_years
0  Braund    22    male   7.2500              25
1   Allen    35    male  71.2833              38
2  Bonnel    58  female      NaN              61

___

## <i class="fa-solid fa-pencil"></i> Exercise

Create a new column called 'Fare_in_DKK' based on the column 'Fare'.

We assume the old fare prices to be in GBP and the exchange rate to be £1 = 8.7 DKK

```{admonition} Solution
:class: dropdown

    df['Fare_in_DKK'] = df['Fare'] * 8.7

This solution creates a new column in the `DataFrame` named 'Fare_in_DKK', which contains the fare prices converted from GBP to DKK using the given exchange rate.<br/>
Each fare value in GBP is multiplied by the exchange rate to obtain the corresponding fare value in DKK.

___

## Key points

* Import the library, aka `import pandas as pd`.

* A table of data is stored as a pandas `DataFrame`.

* The `shape`and `dtypes` attributes are convenient for a first check.

* Each column in a `DataFrame` is a `Series`.

* We can append `Series` as columns to an existing `DataFrame`.